console.log('Homework 8 - Складніші цикли');

//1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
console.log('');
console.log('1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).');

for(let i = 20; i <= 30; i += 0.5){
    console.log(i);
}

// 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
console.log('');
console.log('2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.');

const exchangeRate = 27;

for(let i = 10; i <= 100; i += 10){
    console.log(`Вартість ${i} доларів складає ${i*exchangeRate} гривень`);
}

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
console.log('');
console.log('3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.');

const number = 26;
console.log(`Дане ціле число ${number}`);
console.log(`Цілі числа від 1 до 100, квадрат яких не перевищує ${number}:`);
let i = 1;
while (i*i <= number && i <= 100) {
    console.log(`${i} (${i*i})`);
    i++;
}

// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
console.log('');
console.log('4. Дане ціле число. З\'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).');

const simpleOrNot = 95;
console.log(`Дане ціле число ${simpleOrNot}`);
for (let i = 2; i <= simpleOrNot; i++){
    if(simpleOrNot%i === 0 && i < simpleOrNot){
        console.log(`Число ${simpleOrNot} ділиться на ${i}`);
        console.log(`Число ${simpleOrNot} не є простим`);
        break;
    } else if(simpleOrNot%i === 0 && i === simpleOrNot){
        console.log(`Число ${simpleOrNot} є простим`);
    }
}

// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
console.log('');
console.log('5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).');

const someNumber = 243;
console.log(`Дане число ${someNumber}`);
i = 0;
while( 3**i <= someNumber){
    (3**i === someNumber)
        ? console.log(`Число ${someNumber} можна одержати шляхом зведення числа 3 у ступінь ${i}`)
        : console.log(`Число ${someNumber} не можна одержати шляхом зведення числа 3 у ступінь ${i}`);
    i++;
}